# Создание файла bubble_sort.py
# Определение функции сортировки пузырьком и библиотек
from random import randint


def bubble_sort(arr):  # Объявляем функцию
    n = len(arr)  # Присваиваем длину arr "то что ввёл пользователь"
    for i in range(n):  # Проход по каждому числу из длины
        for j in range(0, n-i-1):  # Ограничиваем
            if arr[j] > arr[j+1]:  # Меняем или нет?
                arr[j], arr[j+1] = arr[j+1], arr[j]  # обмен


# Запрос числа num
num = int(input("Введите натуральное число меньше 10: "))

# Создание пустого массива
array = []

# Наполнение массива рандомными натуральными числами через пустышку
for _ in range(num):
    array.append(randint(1, 100))

# Вывод исходного массива
print("Исходный массив:", array)

# Сортировка массива методом пузырька
bubble_sort(array)

# Вывод отсортированного массива
print("Отсортированный массив:", array)
